In [198]:
import pandas as pd
homelessness=pd.read_csv('F:\DATACAMP\DATA MANIPULATION\C_1\homelessness.csv')
homelessness.values

array([[0, 'East South Central', 'Alabama', 2570.0, 864.0, 4887681],
       [1, 'Pacific', 'Alaska', 1434.0, 582.0, 735139],
       [2, 'Mountain', 'Arizona', 7259.0, 2606.0, 7158024],
       [3, 'West South Central', 'Arkansas', 2280.0, 432.0, 3009733],
       [4, 'Pacific', 'California', 109008.0, 20964.0, 39461588],
       [5, 'Mountain', 'Colorado', 7607.0, 3250.0, 5691287],
       [6, 'New England', 'Connecticut', 2280.0, 1696.0, 3571520],
       [7, 'South Atlantic', 'Delaware', 708.0, 374.0, 965479],
       [8, 'South Atlantic', 'District of Columbia', 3770.0, 3134.0,
        701547],
       [9, 'South Atlantic', 'Florida', 21443.0, 9587.0, 21244317],
       [10, 'South Atlantic', 'Georgia', 6943.0, 2556.0, 10511131],
       [11, 'Pacific', 'Hawaii', 4131.0, 2399.0, 1420593],
       [12, 'Mountain', 'Idaho', 1297.0, 715.0, 1750536],
       [13, 'East North Central', 'Illinois', 6752.0, 3891.0, 12723071],
       [14, 'East North Central', 'Indiana', 3776.0, 1482.0, 6695497],
       [15, 'West North Central', 'Iowa', 1711.0, 1038.0, 3148618],
       [16, 'West North Central', 'Kansas', 1443.0, 773.0, 2911359],
       [17, 'East South Central', 'Kentucky', 2735.0, 953.0, 4461153],
       [18, 'West South Central', 'Louisiana', 2540.0, 519.0, 4659690],
       [19, 'New England', 'Maine', 1450.0, 1066.0, 1339057],
       [20, 'South Atlantic', 'Maryland', 4914.0, 2230.0, 6035802],
       [21, 'New England', 'Massachusetts', 6811.0, 13257.0, 6882635],
       [22, 'East North Central', 'Michigan', 5209.0, 3142.0, 9984072],
       [23, 'West North Central', 'Minnesota', 3993.0, 3250.0, 5606249],
       [24, 'East South Central', 'Mississippi', 1024.0, 328.0, 2981020],
       [25, 'West North Central', 'Missouri', 3776.0, 2107.0, 6121623],
       [26, 'Mountain', 'Montana', 983.0, 422.0, 1060665],
       [27, 'West North Central', 'Nebraska', 1745.0, 676.0, 1925614],
       [28, 'Mountain', 'Nevada', 7058.0, 486.0, 3027341],
       [29, 'New England', 'New Hampshire', 835.0, 615.0, 1353465],
       [30, 'Mid-Atlantic', 'New Jersey', 6048.0, 3350.0, 8886025],
       [31, 'Mountain', 'New Mexico', 1949.0, 602.0, 2092741],
       [32, 'Mid-Atlantic', 'New York', 39827.0, 52070.0, 19530351],
       [33, 'South Atlantic', 'North Carolina', 6451.0, 2817.0, 10381615],
       [34, 'West North Central', 'North Dakota', 467.0, 75.0, 758080],
       [35, 'East North Central', 'Ohio', 6929.0, 3320.0, 11676341],
       [36, 'West South Central', 'Oklahoma', 2823.0, 1048.0, 3940235],
       [37, 'Pacific', 'Oregon', 11139.0, 3337.0, 4181886],
       [38, 'Mid-Atlantic', 'Pennsylvania', 8163.0, 5349.0, 12800922],
       [39, 'New England', 'Rhode Island', 747.0, 354.0, 1058287],
       [40, 'South Atlantic', 'South Carolina', 3082.0, 851.0, 5084156],
       [41, 'West North Central', 'South Dakota', 836.0, 323.0, 878698],
       [42, 'East South Central', 'Tennessee', 6139.0, 1744.0, 6771631],
       [43, 'West South Central', 'Texas', 19199.0, 6111.0, 28628666],
       [44, 'Mountain', 'Utah', 1904.0, 972.0, 3153550],
       [45, 'New England', 'Vermont', 780.0, 511.0, 624358],
       [46, 'South Atlantic', 'Virginia', 3928.0, 2047.0, 8501286],
       [47, 'Pacific', 'Washington', 16424.0, 5880.0, 7523869],
       [48, 'South Atlantic', 'West Virginia', 1021.0, 222.0, 1804291],
       [49, 'East North Central', 'Wisconsin', 2740.0, 2167.0, 5807406],
       [50, 'Mountain', 'Wyoming', 434.0, 205.0, 577601]], dtype=object)

In [199]:
homelessness.sort_values(['family_members','state_pop'], ascending=[False,False]).head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
32,32,Mid-Atlantic,New York,39827.0,52070.0,19530351
4,4,Pacific,California,109008.0,20964.0,39461588
21,21,New England,Massachusetts,6811.0,13257.0,6882635
9,9,South Atlantic,Florida,21443.0,9587.0,21244317
43,43,West South Central,Texas,19199.0,6111.0,28628666

In [200]:
scolumns=homelessness[['state','region']]
scolumns.head()

        state              region
0     Alabama  East South Central
1      Alaska             Pacific
2     Arizona            Mountain
3    Arkansas  West South Central
4  California             Pacific

In [201]:
subrows=homelessness[homelessness['state'].isin(['Alaska'])] #put []in .isin() method during subsetting rows
subrows

   Unnamed: 0   region   state  individuals  family_members  state_pop
1           1  Pacific  Alaska       1434.0           582.0     735139

In [202]:
# how to create a new column

homelessness['total']=homelessness['individuals']+homelessness['family_members']
homelessness.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop,total
0,0,East South Central,Alabama,2570.0,864.0,4887681,3434.0
1,1,Pacific,Alaska,1434.0,582.0,735139,2016.0
2,2,Mountain,Arizona,7259.0,2606.0,7158024,9865.0
3,3,West South Central,Arkansas,2280.0,432.0,3009733,2712.0
4,4,Pacific,California,109008.0,20964.0,39461588,129972.0

In [203]:
sales=pd.read_csv('F:\DATACAMP\DATA MANIPULATION\C_1\sales_subset.csv')
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [204]:
sales.shape

(10774, 10)

In [205]:
sales['type'].value_counts(normalize=True)

type
A    0.91628
B    0.08372
Name: proportion, dtype: float64

In [206]:
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [207]:
print(sales["weekly_sales"].mean())
print(sales["weekly_sales"].median())

23843.95014850566
12049.064999999999

In [208]:
#finding the oldest and latest dates

oldest_date=sales['date'].max()
recent_date=sales['date'].min()
print(oldest_date)
print(recent_date)

2012-10-26
2010-02-05

In [209]:
import numpy as np
mean=sales['weekly_sales'].agg('mean')
median=sales['weekly_sales'].agg('median')
print('mean:',mean)
print('median:', median)

def iqr(column):
    return column.quantile(.75)- column.quantile(.25)

print(sales[["weekly_sales","temperature_c"]].agg([iqr, np.median]))

mean: 23843.95014850566
median: 12049.064999999999
        weekly_sales  temperature_c
iqr        28482.735      16.583333
median     12049.065      16.966667

In [210]:
sales_subset=sales[(sales['department']==1) & (sales['store']==1)]

In [211]:
sales_subset['date'].sort_values()

sales_subset['cum_sum']=sales_subset['weekly_sales'].cumsum()
sales_subset['cum_max']=sales_subset['weekly_sales'].cummax()

print(sales_subset[['date','cum_sum', 'cum_max']])

          date    cum_sum   cum_max
0   2010-02-05   24924.50  24924.50
1   2010-03-05   46752.40  24924.50
2   2010-04-02  104010.83  57258.43
3   2010-05-07  121424.77  57258.43
4   2010-06-04  138982.86  57258.43
5   2010-07-02  155316.00  57258.43
6   2010-08-06  172824.41  57258.43
7   2010-09-03  189066.19  57258.43
8   2010-10-01  209160.38  57258.43
9   2010-11-05  243399.26  57258.43
10  2010-12-03  265916.82  57258.43
11  2011-01-07  281901.06  57258.43

C:\Users\finac\AppData\Local\Temp\ipykernel_17372\2273666251.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_subset['cum_sum']=sales_subset['weekly_sales'].cumsum()
C:\Users\finac\AppData\Local\Temp\ipykernel_17372\2273666251.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_subset['cum_max']=sales_subset['weekly_sales'].cummax()

In [212]:
store_types=sales.drop_duplicates(subset=["store","type"])
print(store_types.head())
store_department=sales.drop_duplicates(subset=["store","department"])
print(store_department.head())

      Unnamed: 0  store type  department        date  weekly_sales  \
0              0      1    A           1  2010-02-05      24924.50
901          901      2    A           1  2010-02-05      35034.06
1798        1798      4    A           1  2010-02-05      38724.42
2699        2699      6    A           1  2010-02-05      25619.00
3593        3593     10    B           1  2010-02-05      40212.84

      is_holiday  temperature_c  fuel_price_usd_per_l  unemployment
0          False       5.727778              0.679451         8.106
901        False       4.550000              0.679451         8.324
1798       False       6.533333              0.686319         8.623
2699       False       4.683333              0.679451         7.259
3593       False      12.411111              0.782478         9.765
    Unnamed: 0  store type  department        date  weekly_sales  is_holiday  \
0            0      1    A           1  2010-02-05      24924.50       False
12          12      1    A           2  2010-02-05      50605.27       False
24          24      1    A           3  2010-02-05      13740.12       False
36          36      1    A           4  2010-02-05      39954.04       False
48          48      1    A           5  2010-02-05      32229.38       False

    temperature_c  fuel_price_usd_per_l  unemployment
0        5.727778              0.679451         8.106
12       5.727778              0.679451         8.106
24       5.727778              0.679451         8.106
36       5.727778              0.679451         8.106
48       5.727778              0.679451         8.106

In [213]:
holyday_dates=sales[sales['is_holiday']]
display(holyday_dates.head())
display(holyday_dates.shape)

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
498,498,1,A,45,2010-09-10,11.47,True,25.938889,0.677602,7.787
691,691,1,A,77,2011-11-25,1431.00,True,15.633333,0.854861,7.866
896,896,1,A,99,2011-11-25,2400.00,True,15.633333,0.854861,7.866
1532,1532,2,A,60,2010-09-10,8.80,True,26.161111,0.677602,8.099
1587,1587,2,A,77,2011-11-25,1431.00,True,13.533333,0.854861,7.441

(42, 10)

In [214]:
holyday_dates=sales[sales['is_holiday']].drop_duplicates(subset='date')
display(holyday_dates.head())
display(holyday_dates.shape)

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
498,498,1,A,45,2010-09-10,11.47,True,25.938889,0.677602,7.787
691,691,1,A,77,2011-11-25,1431.00,True,15.633333,0.854861,7.866
2315,2315,4,A,47,2010-02-12,498.00,True,-1.755556,0.679715,8.623
6735,6735,19,A,39,2012-09-07,13.41,True,22.333333,1.076766,8.193
6810,6810,19,A,47,2010-12-31,-449.00,True,-1.861111,0.881278,8.067

(7, 10)

In [215]:
holyday_dates['date']

498     2010-09-10
691     2011-11-25
2315    2010-02-12
6735    2012-09-07
6810    2010-12-31
6815    2012-02-10
6820    2011-09-09
Name: date, dtype: object

In [216]:
store_types['type'].value_counts()
store_types['type'].value_counts(normalize=True)

type
A    0.916667
B    0.083333
Name: proportion, dtype: float64

In [217]:
store_department['department'].value_counts(sort='ascending')

department
1     12
55    12
72    12
71    12
67    12
      ..
37    10
48     8
50     6
39     4
43     2
Name: count, Length: 80, dtype: int64

In [218]:
store_department['department'].value_counts(normalize=True)

department
1     0.012917
55    0.012917
72    0.012917
71    0.012917
67    0.012917
        ...
37    0.010764
48    0.008611
50    0.006459
39    0.004306
43    0.002153
Name: proportion, Length: 80, dtype: float64

In [219]:
total_weekly_sales=sales['weekly_sales'].sum()
print(total_weekly_sales)

type_A_sales=sales[sales['type']=='A']['weekly_sales'].sum()
print(type_A_sales)

type_B_sales=sales[sales['type']=='B']['weekly_sales'].sum()
print(type_B_sales)

type_C_sales=sales[sales['type']=='C']['weekly_sales'].sum()
print(type_C_sales)

totalsalesprop_bytype=[type_A_sales, type_B_sales,type_C_sales]/total_weekly_sales
display(totalsalesprop_bytype)

256894718.89999998
233716315.01
23178403.89
0.0

array([0.9097747, 0.0902253, 0.       ])

In [220]:
total_weekly_sales
sales.groupby(['type','is_holiday'])['weekly_sales'].agg(sum)

type  is_holiday
A     False         2.336927e+08
      True          2.360181e+04
B     False         2.317678e+07
      True          1.621410e+03
Name: weekly_sales, dtype: float64

In [221]:
import numpy as np
by_type=sales.groupby('type')['weekly_sales'].agg([np.min, np.max, np.mean,np.median])
display(by_type)

unemployment_fuelprice=sales.groupby('type') [['unemployment','fuel_price_usd_per_l']].agg([np.min, np.max, np.mean,np.median])
display(unemployment_fuelprice)

         min        max          mean    median
type
A    -1098.0  293966.05  23674.667242  11943.92
B     -798.0  232558.51  25696.678370  13336.08

     unemployment                         fuel_price_usd_per_l            \
              min    max      mean median                  min       max
type
A           3.879  8.992  7.972611  8.067             0.664129  1.107410
B           7.170  9.765  9.279323  9.199             0.760023  1.107674


          mean    median
type
A     0.744619  0.735455
B     0.805858  0.803348

In [222]:
import pandas as pd
sales.pivot_table(columns='is_holiday', index='type',values=['weekly_sales'], aggfunc=[ np.mean,np.median])

                    mean                  median
            weekly_sales            weekly_sales
is_holiday         False      True         False    True
type
A           23768.583523  590.04525    12028.955   37.500
B           25751.980533  810.70500    13348.680  810.705

In [223]:
department_type_pivot= sales.pivot_table(index='department', columns= 'type', values='weekly_sales', aggfunc=[np.mean], fill_value=0, margins=True)
display(department_type_pivot)
# https://campus.datacamp.com/courses/data-manipulation-with-pandas/aggregating-dataframes?ex=15 see the link and submit the answer

                    mean
type                   A              B           All
department
1           30961.725379   44050.626667  32052.467153
2           67600.158788  112958.526667  71380.022778
3           17160.002955   30580.655000  18278.390625
4           44285.399091   51219.654167  44863.253681
5           34821.011364   63236.875000  37189.000000
...                  ...            ...           ...
96          21367.042857    9528.538333  20337.607681
97          28471.266970    5828.873333  26584.400833
98          12875.423182     217.428333  11820.590278
99            379.123659       0.000000    379.123659
All         23674.667242   25696.678370  23843.950149

[81 rows x 3 columns]

 # END OF CHAPTER 2